{
  "based": "based in",
  "hello": "Hello! My name is",
  "home": "Home",
  "projects": "Projects",
  "learning": "Learning",
  "welcome": "Welcome to my portfolio, it’s a pleasure to introduce myself.",
  "my-name-is": "My name is",
  "but-my-friends-call-me": "but my friends call me",
  "and-I’m": "and I’m",
  "24-years-old": "<24-years-old />",
  "i-studied": "I studied medicine, and after 5 years in that field, I transitioned into the world of",
  "programming": "<programming />",
  "it’s-been": "It’s been 2 years since that decision, and every day I’m even more confident and convinced than the first",
  "among-my": "Among my",
  "achievements": "<achievements />",
  "i-highlight": "I highlight my participation in",
  "where-i": "where I collaborated in the development of the project from scratch, emphasizing my contributions such as",
  "user-management": "<user-management-and-control-development />",
  "and-y": "and",
  "and": "and",
  "platform": "<platform-performance-optimization />",
  "currently-i": "Currently, I am expanding my stack, having been learning",
  "at-the-same": "At the same time, I am deepening my knowledge in",
  "and-thoroughly": "and thoroughly exploring the",
  "react-ecosystem": "<React-ecosystem />",
  "frontend-addicted": "FrontEnd Addicted",
  "backend-enthusiast": "BackEnd Enthusiast",
  "languages": "Languages",
  "frameworks-libraries": "Frameworks/Libraries",
  "others": "<Others />",
  "others-skills": "Others skills",
  "others-skills-description-1": "I have a C2 level of English proficiency, and I have no issues expressing myself both orally and in writing",
  "others-skills-description-2": "I'm a responsible person, attentive to detail, with a strong ability for self-management, adaptation to any environment, and problem-solving. I enjoy working in teams, as I believe that one of the most valuable moments for learning is when I have the opportunity to listen to others",
  "got-some-ideas": "Got some ideas?",
  "lets-talk": "Let's talk",
  "messages": {
    "just_a_second": "Just A Second...",
    "in_progress": "In progress...",
    "loading": "Loading...",
    "one_moment": "One Moment...",
    "almost_there": "Almost There..."
  },
  "desktop_view": "Best Viewed on Desktop",
  "some": "Some",
  "of-my": "Of my",
  "projects-description": "INGLES",
  "next": "next",
  "prev": "previous",
  "visit": "VISIT",
  "githubIssues-description": "To learn the basics of Tanstack Query, I developed an issue manager using the GitHub API to fetch issues from the React repository. This manager allows filtering issues by status and category and features a fully functional pagination system.",
  "authApp-description": "First experience with Nest; I implemented user authentication and developed a login form using Angular.",
  "gifsApp-description": "To understand the fundamentals of Angular, such as component management, service handling, file organization, and the use of RxJS, I developed a GIF search engine with a search history using an external API.",
  "countryApp-description": "With this project, I continued refining my Angular skills by optimizing service construction and creating components with multiple views. Additionally, I implemented various filters by region, country, and capital using an external API.",
  "mapsApp-description": "I really enjoyed working on this mini project; it was a lot of fun to create. Using Mapbox, I developed a dynamic map that shows your current location and allows you to choose a destination from a search bar. Once the destination is selected, a guide line or 'polyline' is drawn from your location to the destination."
}