{
  "based": "ubicado en",
  "hello": "Hola! Mi nombre es",
  "home": "Inicio",
  "projects": "Proyectos",
  "learning": "Aprendiendo",
  "welcome": "Bienvenido a mi portfolio, es un placer poder presentarme.",
  "my-name-is": "Mi nombre es",
  "but-my-friends-call-me": "pero mis amigos me dicen",
  "and-I’m": "y tengo",
  "24-years-old": "<24-años />",
  "i-studied": "Estudié medicina y, tras 5 años de carrera, me pasé al mundo de la",
  "programming": "<programación />",
  "it’s-been": "Ya hace 2 años de aquella decisión y cada día estoy aún más seguro y convencido que el primero",
  "among-my": "Entre mis",
  "achievements": "<éxitos />",
  "i-highlight": "destaco mi participación en",
  "where-i": "donde colaboré en el desarrollo del proyecto desde 0, resaltando mis aportes como el",
  "user-management": "<desarrollo-en-la-gestión-y-control-de-usuarios />",
  "and-y": "y",
  "and": "asi como la",
  "platform": "<optimización-del-rendimiento de la plataforma />",
  "currently-i": "Actualmente me encuentro ampliando mi stack, aprendiendo",
  "at-the-same": "Al mismo tiempo estoy profundizando mis conocimientos en",
  "and-thoroughly": "y explorando a fondo el",
  "react-ecosystem": "<ecosistema-de-React />",
  "frontend-addicted": "Adicto al Frontend",
  "backend-enthusiast": "Entusiasta del Backend",
  "languages": "Lenguajes",
  "frameworks-libraries": "Frameworks/Librerias",
  "others": "<Otros />",
  "others-skills": "Otras habilidades",
  "others-skills-description-1": "Dispongo de un nivel de inglés equivalente a C2, no tengo problema en expresarme tanto de forma oral como escrita",
  "others-skills-description-2": "Soy una persona responsable, atenta a los detalles, con gran capacidad de autogestión, adaptación a cualquier entorno y resolución de problemas. Disfruto trabajando en equipo, ya que considero que uno de los momentos donde más aprendo es cuando tengo la oportunidad de escuchar a los demás",
  "got-some-ideas": "¿Tenes alguna idea?",
  "lets-talk": "Hablemos",
  "messages": {
    "just_a_second": "Un segundo...",
    "in_progress": "En progreso...",
    "loading": "Cargando...",
    "one_moment": "Un momento...",
    "almost_there": "Casi listo..."
  },
  "desktop_view": "Mejor visto en escritorio",
  "some": "Algunos",
  "of-my": "De mis",
  "projects-description": "ESPAÑOL",
  "next": "siguiente",
  "prev": "anterior",
  "visit": "VISITAR",
  "githubIssues-description": "Para aprender las bases de Tanstack Query, desarrollé un gestor de issues utilizando la API de GitHub para obtener los issues del repositorio de React. Este gestor permite filtrar los issues por estado y categoría, y cuenta con un sistema de paginación totalmente funcional.",
  "authApp-description": "Primer acercamiento con Nest; implementé la autenticación de usuarios y desarrollé un formulario de inicio de sesión con Angular.",
  "gifsApp-description": "Para comprender las bases de Angular, como la gestión de componentes, el manejo de servicios, la organización de archivos, y el uso de RxJS, desarrollé un buscador de GIFs con historial de búsquedas utilizando una API externa.",
  "countryApp-description": "Con este proyecto, continué perfeccionando mis habilidades en Angular, optimizando la construcción de servicios y creando componentes con múltiples vistas. Además, implementé diferentes tipos de filtros por región, país y capital, utilizando una API externa.",
  "mapsApp-description": "La verdad que me divertí bastante realizando este mini proyecto fue muy divertido de realizar. Utilizando Mapbox, creé un mapa dinámico que muestra tu ubicación actual y te permite elegir un punto de destino desde una barra de búsqueda. Una vez seleccionado el destino, se dibuja una línea guía o 'polyline' desde tu ubicación hasta el lugar de destino."
}